
Feature: Търсене на книга в библиотека

  
  Scenario: Търсене на книга в дадената библиотека. 
    Given Читателят отваря търсачката.
    When Въвежда името на книгата "Шерлок Холмс"
    And Стартира търсенето.
    Then Читателят вижда "Available".
   
   Scenario: Търсене на книга, която не е налична.
    Given Читателят отваря търсачката.
    When Въвежда името на книгата "Гордост и предразсъдъци"
    And Стартира търсенето.
    Then Читателят вижда "No Results".
    
    Scenario: Търсене на книга без въведено заглавие.
    Given Читателят отваря търсачката.
    And Стартира търсенето без въведено заглавие.
    Then Читателят вижда "Enter a title".
    

  